; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v11 ?v1)
             (pred_5 ?v4 ?v13)
             (pred_3 ?v11 ?v13)
             (pred_9 ?v6 ?v11 )
	     (pred_1 ?v11)
             (pred_6 ?v2)
             (pred_11 ?v4)
             (pred_12 ?v13)
             (pred_10 ?v11)
             (pred_4 ?v4)
             (pred_7 ?v11)
             (pred_2 ))



(:action op_2
:parameters (?v8 ?v10 ?v12 ?v3)
:precondition (and (pred_6 ?v8) (pred_6 ?v10) (pred_11 ?v12) (pred_12 ?v3)
          (pred_8 ?v8 ?v10) (pred_5 ?v12 ?v3)
                   (pred_3 ?v10 ?v3) (pred_1 ?v8) 
                   (pred_10 ?v10) (pred_4 ?v12))
:effect (and  (pred_7 ?v10) (not (pred_10 ?v10))))


(:action op_4
:parameters (?v8 ?v7)
:precondition (and (pred_6 ?v8) (pred_6 ?v7)
               (pred_1 ?v8) (pred_8 ?v8 ?v7) (pred_7 ?v7))
:effect (and (pred_1 ?v7) (not (pred_1 ?v8))))

(:action op_3
:parameters (?v8 ?v12)
:precondition (and (pred_6 ?v8) (pred_11 ?v12) 
                  (pred_1 ?v8) (pred_9 ?v12 ?v8) (pred_2 ))
:effect (and (pred_4 ?v12)
   (not (pred_9 ?v12 ?v8)) (not (pred_2 ))))


(:action op_5
:parameters (?v8 ?v9 ?v5)
:precondition (and (pred_6 ?v8) (pred_11 ?v9) (pred_11 ?v5)
                  (pred_1 ?v8) (pred_4 ?v5) (pred_9 ?v9 ?v8))
:effect (and (pred_4 ?v9) (pred_9 ?v5 ?v8)
        (not (pred_4 ?v5)) (not (pred_9 ?v9 ?v8))))

(:action op_1
:parameters (?v8 ?v12)
:precondition (and (pred_6 ?v8) (pred_11 ?v12) 
                  (pred_1 ?v8) (pred_4 ?v12))
:effect (and (pred_2 ) (pred_9 ?v12 ?v8) (not (pred_4 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_17 obj_04 obj_03 obj_06 obj_02 obj_14 obj_13 obj_07 obj_20 obj_05 obj_08 obj_16 obj_15 obj_11 obj_18
    obj_01 obj_19
    obj_09 obj_12
    )

    (:init
       (pred_2)

       (pred_6 obj_10)
       (pred_6 obj_17)
       (pred_6 obj_04)
       (pred_6 obj_03)
       (pred_6 obj_06)
       (pred_6 obj_02)
       (pred_6 obj_14)
       (pred_6 obj_13)
       (pred_6 obj_07)
       (pred_6 obj_20)
       (pred_6 obj_05)
       (pred_6 obj_08)
       (pred_6 obj_16)
       (pred_6 obj_15)
       (pred_6 obj_11)
       (pred_6 obj_18)
       (pred_12 obj_01)
       (pred_12 obj_19)
       (pred_11 obj_09)
       (pred_11 obj_12)

       (pred_8 obj_10 obj_06)
       (pred_8 obj_10 obj_17)
       (pred_8 obj_17 obj_02)
       (pred_8 obj_17 obj_04)
       (pred_8 obj_17 obj_10)
       (pred_8 obj_04 obj_14)
       (pred_8 obj_04 obj_03)
       (pred_8 obj_04 obj_17)
       (pred_8 obj_03 obj_13)
       (pred_8 obj_03 obj_04)
       (pred_8 obj_06 obj_07)
       (pred_8 obj_06 obj_02)
       (pred_8 obj_06 obj_10)
       (pred_8 obj_02 obj_20)
       (pred_8 obj_02 obj_14)
       (pred_8 obj_02 obj_17)
       (pred_8 obj_02 obj_06)
       (pred_8 obj_14 obj_05)
       (pred_8 obj_14 obj_13)
       (pred_8 obj_14 obj_04)
       (pred_8 obj_14 obj_02)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_13 obj_03)
       (pred_8 obj_13 obj_14)
       (pred_8 obj_07 obj_16)
       (pred_8 obj_07 obj_20)
       (pred_8 obj_07 obj_06)
       (pred_8 obj_20 obj_15)
       (pred_8 obj_20 obj_05)
       (pred_8 obj_20 obj_02)
       (pred_8 obj_20 obj_07)
       (pred_8 obj_05 obj_11)
       (pred_8 obj_05 obj_08)
       (pred_8 obj_05 obj_14)
       (pred_8 obj_05 obj_20)
       (pred_8 obj_08 obj_18)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_08 obj_05)
       (pred_8 obj_16 obj_15)
       (pred_8 obj_16 obj_07)
       (pred_8 obj_15 obj_11)
       (pred_8 obj_15 obj_20)
       (pred_8 obj_15 obj_16)
       (pred_8 obj_11 obj_18)
       (pred_8 obj_11 obj_05)
       (pred_8 obj_11 obj_15)
       (pred_8 obj_18 obj_08)
       (pred_8 obj_18 obj_11)
       (pred_10 obj_02)
       (pred_10 obj_06)
       (pred_3  obj_02 obj_01)
       (pred_3  obj_06 obj_19)
       (pred_7 obj_10)
       (pred_7 obj_17)
       (pred_7 obj_04)
       (pred_7 obj_03)
       (pred_7 obj_14)
       (pred_7 obj_13)
       (pred_7 obj_07)
       (pred_7 obj_20)
       (pred_7 obj_05)
       (pred_7 obj_08)
       (pred_7 obj_16)
       (pred_7 obj_15)
       (pred_7 obj_11)
       (pred_7 obj_18)

       (pred_5  obj_09 obj_01)
       (pred_5  obj_12 obj_19)
       (pred_9 obj_09 obj_13)
       (pred_9 obj_12 obj_05)
       (pred_1 obj_08)
    )

    (:goal (and
       (pred_9 obj_09 obj_17)
       (pred_9 obj_12 obj_16)
    ))
(:constraints
  (always (not (pred_1 obj_14)))
)
)

; plan
1. (op_4 obj_08 obj_13)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_13)
   goals met: 0 of 2
2. (op_3 obj_13 obj_09)
   deleted: (pred_9 obj_09 obj_13) (pred_2)
   added: (pred_4 obj_09)
   goals met: 0 of 2
3. (op_4 obj_13 obj_08)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_08)
   goals met: 0 of 2
4. (op_4 obj_08 obj_05)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_05)
   goals met: 0 of 2
5. (op_4 obj_05 obj_20)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_20)
   goals met: 0 of 2
6. (op_2 obj_20 obj_02 obj_09 obj_01)
   deleted: (pred_10 obj_02)
   added: (pred_7 obj_02)
   goals met: 0 of 2
7. (op_4 obj_20 obj_05)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_05)
   goals met: 0 of 2
8. (op_5 obj_05 obj_12 obj_09)
   deleted: (pred_4 obj_09) (pred_9 obj_12 obj_05)
   added: (pred_4 obj_12) (pred_9 obj_09 obj_05)
   goals met: 0 of 2
9. (op_4 obj_05 obj_20)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_20)
   goals met: 0 of 2
10. (op_4 obj_20 obj_07)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_07)
   goals met: 0 of 2
11. (op_4 obj_07 obj_16)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_16)
   goals met: 0 of 2
12. (op_1 obj_16 obj_12)
   deleted: (pred_4 obj_12)
   added: (pred_2) (pred_9 obj_12 obj_16)
   goals met: 1 of 2
13. (op_4 obj_16 obj_07)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_07)
   goals met: 1 of 2
14. (op_4 obj_07 obj_20)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_20)
   goals met: 1 of 2
15. (op_4 obj_20 obj_05)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_05)
   goals met: 1 of 2
16. (op_3 obj_05 obj_09)
   deleted: (pred_9 obj_09 obj_05) (pred_2)
   added: (pred_4 obj_09)
   goals met: 1 of 2
17. (op_4 obj_05 obj_20)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_20)
   goals met: 1 of 2
18. (op_4 obj_20 obj_02)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_02)
   goals met: 1 of 2
19. (op_4 obj_02 obj_17)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_17)
   goals met: 1 of 2
20. (op_1 obj_17 obj_09)
   deleted: (pred_4 obj_09)
   added: (pred_2) (pred_9 obj_09 obj_17)
   goals met: 2 of 2
